[
{"Title": " Python for Data Analysis (English Edition) ", "Rating": "4,3 de 5 estrelas", "Availability": "None", "Author": "Wes McKinney", "Description": "Damaged product", "Price": null, "Editor": "O'Reilly Media", "Edicao": "3ª edição (12 agosto 2022)", "Language": "Inglês", "Pages": "989 páginas"},
{"Title": " Python: Guia prático do básico ao avançado (Cientista de dados Livro 2) ", "Rating": "4,6 de 5 estrelas", "Availability": "None", "Author": "Rafael  F.V.C. Santos", "Description": "Felizmente, estamos na era digital e agora podemos escolher, a partir de nossas necessidades e preferências, a linguagem de programação que mais nos agrada. Agora temos a nossa disposição aquela linguagem que mais se dispõe a resolver nossos problemas com o mínimo esforço computacional e de aprendizagem.", "Price": null, "Editor": "rafaelfvcs", "Edicao": "1ª edição (15 novembro 2018)", "Language": "Português", "Pages": "225 páginas"},
{"Title": " Web Scraping com Python: Coletando Mais Dados da web Moderna ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Ryan Mitchell", "Description": "Em apenas um dia esse livro me ajudou a resolver um problema que eu estava tendo a meses, li alguns capítulos e posso afirmar a excelente didática do autor. Não é um livro para iniciantes na programação/Python, encontrei desafios na instalação de pacotes no Windows e tive que buscar por mim mesmo a solução. Encontrei um exemplo no livro que estava desatualizado, mas entrando no github do livro, você encontra a atualização que funciona perfeitamente. Um livro excelente para o que se propõe, mas não pense que é só ler que vai sair um cientista de dados, tem que praticar bastante, correr atrás e o mais importante: desistir jamais! Recomendadissimo!", "Price": "R$ 72,17", "Editor": "Novatec Editora", "Edicao": "2ª edição (1 abril 2019)", "Language": "Português", "Pages": "328 páginas"},
{"Title": " Lógica de programação: A construção de algoritmos e estruturas de dados com aplicações em Python ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "André Luiz Villar Forbellone", "Description": "Assim como está escrito no início do livro: \"Este não é um livro de python\". E não é mesmo. O livro ensina a base de lógica de programação, usando inúmeros exercícios de fixação usando python na aplicação dos algoritmos.", "Price": "R$ 61,90", "Editor": "Bookman", "Edicao": "4ª edição (31 março 2022)", "Language": "Português", "Pages": "332 páginas"},
{"Title": " Use a Cabeça! Python ― 2ª Edição ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Paul Barry", "Description": "O que você aprenderá com este livro? Deseja aprender a linguagem Python sem percorrer um longo caminho com manuais? Com o Use a Cabeça! Python, você entenderá rapidamente os fundamentos do Python trabalhando com estruturas de dados e funções predefinidas. Então poderá construir seu próprio aplicativo web explorando o gerenciamento do banco de dados, tratamento de exceções e administração dos dados. Se você fica intrigado com o que pode fazer com os gerenciadores de texto, decoradores, compreensões e geradores, tudo estará aqui também. Esta segunda edição é uma experiência de aprendizado completa que o ajudará a se tornar um programador Python em pouco tempo. O que é tão especial neste livro? Com base nas últimas pesquisas em Ciência Cognitiva e Teoria do Aprendizado, o livro Use a Cabeça Python usa um formato visualmente rico, para envolver sua mente, em vez da abordagem com muito texto que o deixa com sono. Por que perder tempo lutando contra novos conceitos? Esta experiência de aprendizado multissensorial é designada para o modo como seu cérebro realmente funciona. Depoimentos: “Um livro Python deve ser tão divertido quanto a linguagem. Com o Use a Cabeça Python, o mestre Paul Barry oferece um guia rápido, divertido e envolvente para a linguagem que o deixará bem preparado para escrever um código em Python real.” ― Dr. Eric Freeman, cientista de computação, professor de tecnologia, ex diretor da Disney Online \"O Use a Cabeça Python é uma ótima introdução à linguagem e ao uso do Python no mundo real… Se você estiver procurando uma ótima introdução ao Python, este será o lugar para iniciar.” ― David Griffiths, autor e instrutor de Ágil", "Price": "R$ 113,60", "Editor": "Alta Books", "Edicao": "2ª edição (13 agosto 2018)", "Language": "Português", "Pages": "616 páginas"},
{"Title": " Automate the Boring Stuff with Python, 2nd Edition: Practical Programming for Total Beginners ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Al Sweigart", "Description": "Learn how to code while you write programs that effortlessly perform useful feats of automation! ", "Price": "R$ 208,52", "Editor": "No Starch Press", "Edicao": "Illustrated edição (12 novembro 2019)", "Language": "Inglês", "Pages": "592 páginas"},
{"Title": " Aprenda Python 3 do jeito certo: uma introdução muito simples ao incrível mundo dos computadores e da codificação ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Zed Shaw", "Description": "Zed Shaw aperfeiçoou o melhor sistema do mundo para aprender o Python 3. Siga-o e você será bem-sucedido ― como os milhões de novatos que Zed ensinou até hoje! Você entra com a disciplina, o comprometimento e a persistência; o autor proporciona o resto.No livro Aprenda Python 3 Hard Way, você estudará o Python através de 52 exercícios brilhantemente desenvolvidos. Leia-os. Digite o código com precisão (sem copiar nem colar!). Corrija seus erros. Veja a execução dos programas. Ao fazer isso, aprenderá como funciona um computador; como são os bons programas; e como ler, escrever e pensar em código. Além disso, Zed ensina ainda mais em + 5 horas de vídeo, mostrando como pausar, corrigir e depurar seu código ― ao vivo, enquanto faz os exercícios.Será difícil no início. Mas logo você pegará o jeito ― e se sentirá ótimo! Este curso recompensará você por cada minuto gasto nele. Em pouco tempo você conhecerá uma das linguagens de programação mais populares e poderosas do mundo. Você será um programador Python.• Completos iniciantes, com zero experiência em programação• Desenvolvedores júnior que conhecem uma ou duas linguagens• Antigos pro_x001F_ ssionais que não escrevem código há anos• Pro_x001F_ssionais experientes que desejam um curso rápido, simples e intensivo de Python 3", "Price": "R$ 51,94", "Editor": "Alta Books", "Edicao": "1ª edição (1 julho 2019)", "Language": "Português", "Pages": "320 páginas"},
{"Title": " Python Para Data Science: E Machine Learning Descomplicado ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Amílcar Netto", "Description": "A era da informação trouxe consigo uma avalanche nunca vista na criação de entendimento digital. O acesso e a interpretação desses dados tornaram-se um diferencial estratégico para empresas e também para governos, e podem dar suporte a estudos em várias áreas, como Economia e Política, passando pelas Ciências Sociais. É nesse contexto que as ferramentas necessárias para o tratamento desses dados foram desenvolvidas, de forma a retornar conhecimento relevante a partir desse volume imenso de informações. Nesta obra, você terá contato com os primeiros conceitos de Ciência de Dados (Data Science). Para auxiliar o aprendizado, são desenvolvidos projetos práticos com ferramentas consideradas estado da arte na criação de aplicações de aprendizado de máquina, e, como brinde, todo o código desenvolvido está disponível para download gratuitamente no site da editora. “No mercado moderno, altamente competitivo, o conhecimento de Ciência de Dados e técnicas para sua aplicação prática é mais que um requisito: tornou-se um diferencial para qualquer profissional ou empresa.” O leitor terá uma introdução rápida à linguagem Python (para aqueles que não a conhecem) e às bibliotecas usadas em Análise de Dados. Serão desenvolvidos projetos práticos, “do zero”, para familiarizá-lo com as tecnologias envolvidas. Ao final do livro, você conhecerá uma ferramenta que permite desenvolver tais estudos mesmo sem saber programar. Esta obra aborda as principais ferramentas usadas por profissionais dessa área, tão fascinante, de modo didático e com ênfase na aplicação imediata dos conceitos apresentados.", "Price": "R$ 78,12", "Editor": "Alta Books", "Edicao": "1ª edição (8 julho 2021)", "Language": "Português", "Pages": "384 páginas"},
{"Title": " Introdução à Computação Usando Python - um Foco no Desenvolvimento de Aplicações ", "Rating": "4,3 de 5 estrelas", "Availability": "Em estoque.", "Author": "Ljubomir Perkovic", "Description": "Os leitores de Introdução à Computação Usando Python: um Foco no Desenvolvimento de Aplicações vão perceber que os conceitos serão apresentados gradativamente para que haja uma introdução inclusiva à ciência da computação, e críticos da área definem a metodologia do livro-texto como a utilização da “ferramenta certa para o trabalho no momento certo”.Apesar do título, a obra tem carga maior do que apenas introdutória, uma vez que o livro-texto faz muito mais do que apenas introduzir estudantes à computação. Os leitores terão acesso a orientações de problemas práticos com soluções aparecendo no decorrer de todo o texto. Sua ampla cobertura também o torna ideal para estudantes que precisam dominar os conceitos de programação e computação.Para que o leitor consiga manter-se focado nos conteúdos e atento às armadilhas inerentes da ciência da computação, o livro-texto apresenta caixas de aviso que servirão para conquistar ainda mais a atenção do estudante nos momentos necessários da obra. Ele também utiliza caixas de desvio para explorar rapidamente alguns tópicos interessantes, mas que fogem do curso principal. Essa grande quantidade de caixas, problemas práticos, figuras e tabelas cria, propositalmente, interrupções visuais no texto que irão torná-lo mais dinâmico e comunicativo.Os capítulos incluem ainda uma introdução à resolução de problemas técnicos e algoritmos clássicos, resolução de problemas e programação, além de formas de aplicar competências básicas para o desenvolvimento de aplicativos.", "Price": "R$ 162,00", "Editor": "LTC", "Edicao": "1ª edição (1 abril 2016)", "Language": "Português", "Pages": "516 páginas"},
{"Title": " Data Science Do Zero: Noções Fundamentais com Python ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Joel Grus", "Description": "Bom livro para quem quer ter uma ideia geral. Não espere aprender a usar bibliotecas especializadas aqui. O foco do livro é desenvolver os conceitos para quem quer ingressar na área. Neste sentido, o livro atende bem.", "Price": "R$ 59,90", "Editor": "Alta Books", "Edicao": "2ª edição (19 março 2021)", "Language": "Português", "Pages": "416 páginas"},
{"Title": " Python Crash Course, 2nd Edition: A Hands-On, Project-Based Introduction to Programming (English Edition) ", "Rating": "4,7 de 5 estrelas", "Availability": "None", "Author": "Eric Matthes", "Description": "The best-selling Python book in the world, with over 1 million copies sold!", "Price": null, "Editor": "No Starch Press", "Edicao": "2º edição (21 maio 2019)", "Language": "Inglês", "Pages": "544 páginas"},
{"Title": " Python e Mercado Financeiro: Programação Para Estudantes, Investidores e Analistas ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Marco Antonio Leonel Caetano", "Description": "Gostei do livro, excelente! Vai direto ao assunto.", "Price": "R$ 94,72", "Editor": "Blucher", "Edicao": "1ª edição (21 maio 2021)", "Language": "Português", "Pages": "532 páginas"},
{"Title": " Pense em Python: Pense Como um Cientista da Computação ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Allen Downey", "Description": "A leitura é leve, e é um bom livro pra quem é bem iniciante e tem conhecimento mínimo de Python, mas o livro não aprofunda nem um pouco na linguagem. Python não me pqrece o foco do livro, mas apenas um meio para o autor explicar operações que quase todas as linguagens de alto nível tem. Além disso, muitos exemplos matemáticos são usados no livro, dificultando a compreensão e ritmo de leitura para quem não sabe ou lembra dos assuntos abordados. Você não vai aprender Python e nem aprofundar seus conhecimentos de forma significativa nesse livro se já tiver experiência intermediaria na linguagem. Esperava muito mais.", "Price": "R$ 61,98", "Editor": "Novatec Editora (7 junho 2016)", "Edicao": "None", "Language": "Português", "Pages": "312 páginas"},
{"Title": " Fluent Python: Clear, Concise, and Effective Programming ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Luciano Ramalho", "Description": "Livro focado em mostrar funcionalidades do ecossistema Python. Importante ressaltar que o livro não é recomendado para completos iniciantes.", "Price": "R$ 369,40", "Editor": "O'Reilly Media", "Edicao": "2nd ed. edição (10 maio 2022)", "Language": "Inglês", "Pages": "1012 páginas"},
{"Title": " Programação em Python 3 ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Mark Summerfield", "Description": "Python 3 é a melhor versão já lançada no que diz respeito à linguagem Python. Ela é muito mais poderosa, conveniente, consistente e expressiva do que jamais foi. Agora, no comando do programador Mark Summerfield, você poderá aprender como escrever códigos que se beneficiam totalmente das vantagens oriundas das características do Python 3 e de seus idiomas. Primeiro livro escrito a partir de uma visão totalmente baseada em Python 3, Programação em Python 3 traz o conhecimento que você precisa para escrever qualquer programa, utilizar qualquer biblioteca padrão ou de terceiros do Python e criar novos módulos de biblioteca por sua conta. Summerfield mostra todo o seu vasto conhecimento e experiência com o Python e o compartilha profundamente com o Python 3, algo que você não vai encontrar em nenhum outro lugar. Ele começa por iluminar o lindo coração do Python, os oito elementos-chave que você vai precisar para escrever programas robustos e altamente desenvolvidos. Apoiando-se em cima destes elementos condutores, ele introduz novos tópicos, desenvolvidos para fortalecer gradualmente sua especialidade (na prática), com exemplos conceituais que farão com que você participe efetivamente. A abordagem do livro inclui: desenvolvimento em Python, utilizando paradigmas de programações procedurais, orientado a objeto e funcionais, criação de pacotes e módulos personalizados, escrita e leitura de arquivos binários, de texto e XML, incluindo compressão opcional, acesso aleatório e analisadores de texto e analisadores XML, avanço gradual em tipos de dados, acumulados, estruturas de controle e funções, divisão de cargas sobre múltiplos processos e linhas de execução, programação de bancos de dados SQL e arquivos DBM chave-valor, utilização da minilinguagem de expressão regular e dos módulos do Python, construção de aplicações baseadas em programação GUI úteis e eficientes, técnicas de programação avançada, incluindo geradores, decoradores de classe e função, gerenciadores de contexto, descritores, classes-base abstratas, metaclasses e muito mais, programação em Python 3 prestará tanto a função de um tutorial quanto a de uma referência de linguagem, e é acompanhado por uma extensa gama de códigos, passíveis de serem baixados, todos eles foram testados com a versão final do Python 3 no Windows, Linux e Mac OS X.", "Price": "R$ 111,22", "Editor": "Alta Books", "Edicao": "1ª edição (23 novembro 2009)", "Language": "Português", "Pages": "520 páginas"},
{"Title": " Use a cabeça!: aprenda a programar ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Eric Freeman", "Description": "Use a cabeça! Aprenda a Programar. A quem se destina este livro? Se você responder \"sim\" às perguntas abaixo, este livro foi feito para você! -Você gostaria de aprender a programar? -Quer dominar o desenvolvimento de software de sucesso, ganhar muito dinheiro e se mudar para sua própria ilha particular?-Você prefere aprender e colocar em prática seus conhecimentos em vez de passar várias horas ouvindo uma aula? Se você responder “sim” a alguma das perguntas abaixo, fique longe deste livro! -Você está procurando uma introdução rápida ou um livro de referência em programação?-Você prefere ter as unhas do pé arrancadas por 15 macacos raivosos a aprender algo novo?-Na sua opinião, um livro Aprenda a Programar deve abordar tudo, especialmente temas obscuros que ninguém aborda? E se este livro fosse um tédio total, você acharia melhor? O que você aprenderá com este livro? Não é segredo que o mundo à sua volta está cada vez mais conectado, configurável, programável e computacional. Você pode continuar como um participante passivo ou pode aprender a programar. Com Use a Cabeça! Aprenda a Programar você aprenderá a pensar computacionalmente e a escrever código para fazer com que qualquer coisa com um CPU faça coisas por você.Usando a linguagem de programação Python, você aprenderá os conceitos centrais da programação, além dos tópicos fundamentais da ciência da computação, como estruturas de dados, armazenamento, abstração, recursão e modularidade. Por que este livro parece tão diferente? Baseado na última pesquisa sobre ciência cognitiva e teoria do aprendizado, este livro usa um formato visualmente rico para envolver sua mente em vez de uma abordagem textual que dá sono. Por que gastar seu tempo lutando com novos conceitos?Esta experiência de aprendizagem multissensorial é projetada para a maneira como seu cérebro realmente funciona.", "Price": "R$ 95,74", "Editor": "Alta Books", "Edicao": "1ª edição (18 junho 2019)", "Language": "Português", "Pages": "640 páginas"},
{"Title": " 6 em 1 - Coleção Python do ZERO às Redes Neurais Artificiais ", "Rating": "4,9 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Este livro é um compilado dos seguintes títulos:", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "1258 páginas"},
{"Title": " Python Testing with Pytest: Simple, Rapid, Effective, and Scalable ", "Rating": "4,4 de 5 estrelas", "Availability": "Em estoque.", "Author": "Brian Okken", "Description": "I used the first edition and found it helpful. This update is worth the cost of re-buying. Pytest is a great product. This book reads quick and is easy to use when looking for an answer. If it becomes available in a  Kindle version I will add that too.", "Price": "R$ 219,29", "Editor": "Pragmatic Bookshelf", "Edicao": "2nd ed. edição (29 março 2022)", "Language": "Inglês", "Pages": "274 páginas"},
{"Title": " Learning Python: Powerful Object-Oriented Programming ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Mark Lutz", "Description": "Um livro bem profundo na linguagem Python! Todos os fundamentos. Bem completo.", "Price": "R$ 314,72", "Editor": "O'Reilly Media", "Edicao": "5th ed. edição (6 julho 2013)", "Language": "Inglês", "Pages": "1540 páginas"},
{"Title": " Projetos com Python e Arduino: Como Desenvolver Projetos Práticos de Eletrônica, Automação e Iot ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "HUMBERTO AUGUSTO PIOVESANA ZANETTI", "Description": "Arduino e Python são duas tecnologias gratuitas e com o objetivo principal de serem acessíveis para todos, e utiliza por muitos profissionais e entusiastas em tecnologia. Arduino é a plataforma de prototipagem mais utilizada, estando presente em projetos que variam do básico ao avançado. A linguagem Python cresce cada dia no mercado, e ainda é muito adotada por iniciantes por sua legibilidade, flexibilidade e grande comunidade de desenvolvedores. Esta obra apresenta projetos que unem essas tecnologias, com o objetivo de criar projetos didáticos, mas que podem ser utilizados ou adaptados para diversos fins. Os projetos apresentados aqui abordam conceitos básicos de eletrônica e programação, utilizando LEDs, botões e sensores, assim como projetos mais avançados, utilizando interface gráfica e voltados a Internet das Coisas. A abordagem prática adotada neste livro pode auxiliar desde o iniciante, que não possui conhecimentos em programação e eletrônica, até pessoas com conhecimentos avançados na área, mas que nunca fizeram projetos unindo Arduino e Python. Ao longo do decorrer do livro, é esperado que o leitor se interesse cada vez mais pelas tecnologias, e que se motive a aplicar os conhecimentos aqui em seus projetos pessoais e profissionais.", "Price": "R$ 30,99", "Editor": "Editora Érica", "Edicao": "1ª edição (8 setembro 2020)", "Language": "Português", "Pages": "120 páginas"},
{"Title": " Tratamento de Dados com Python + Pandas ", "Rating": "4,5 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Tratamento de Dados com Python + Pandas", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "127 páginas"},
{"Title": " Arquitetura limpa: O guia do artesão para estrutura e design de software ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Kevlin Henney", "Description": "As regras universais de arquitetura de software aumentam dramaticamente a produtividade dos desenvolvedores ao longo da vida dos sistemas de software. Agora, aproveitando o sucesso dos seus best-sellers \"Código Limpo\" e \"O Codificador Limpo\", o lendário artesão de software Robert C. Martin (“Uncle Bob”) vai revelar essas regras e ajudar o leitor a aplicá-las.A \"Arquitetura Limpa\" de Martin não é só mais um catálogo de opções. Com base em meio século de experiência nos mais variados ambientes de software, Martin indica as escolhas que você deve fazer e explica por que elas são cruciais para o seu sucesso. Como já era esperado do Uncle Bob, este livro está cheio de soluções simples e diretas para os desafios reais que você enfrentará - aqueles que irão influenciar diretamente o sucesso ou fracasso dos seus projetos. Aprenda sobre as metas dos arquitetos de software - e as principais disciplinas e práticas que podem concretizá-las;Domine os princípios essenciais do design de software para abordar função, separação de componentes e gestão de dados;Veja como os paradigmas de programação impõem disciplina ao restringirem as ações dos desenvolvedores;Saiba identificar o que é crucialmente importante e o que é apenas um “detalhe”;Implemente estruturas ótimas e de alto nível para web, banco de dados, thick-client, console e aplicativos incorporados;Defina limites e camadas adequadas e organize os componentes e serviços;Saiba por que designs e arquiteturas dão errado e como prevenir (ou corrigir) essas falhas.", "Price": "R$ 69,34", "Editor": "Alta Books", "Edicao": "1ª edição (23 abril 2019)", "Language": "Português", "Pages": "432 páginas"},
{"Title": " Robust Python: Write Clean and Maintainable Code ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Patrick Viafore", "Description": "Ce livre est ok si vous ne connaissez rien aux concepts car c’est une première introduction. Dans le cas contraire, si vous avez déjà des notions, vous allez être déçu car il ne traite aucun sujet en profondeur, excepté le typage qui est largement détaillé  et occupe la moitié du livre.", "Price": "R$ 171,81", "Editor": "O'Reilly Media (3 agosto 2021)", "Edicao": "None", "Language": "Inglês", "Pages": "380 páginas"},
{"Title": " Python for Excel: A Modern Environment for Automation and Data Analysis ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Felix Zumstein", "Description": "If you have read or have the Python for Data Analysis by O'Rielly then you may not need this. All of the major Python for excel stuff was in the third section (the book has three sections). For a book that's title that is is all about Excel it's pretty little on excel until section three. So overall underwhelmed", "Price": "R$ 302,00", "Editor": "O'Reilly Media (13 abril 2021)", "Edicao": "None", "Language": "Inglês", "Pages": "335 páginas"},
{"Title": " Use a Cabeça! Python ― 2ª Edição ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Paul Barry", "Description": "O que você aprenderá com este livro? Deseja aprender a linguagem Python sem percorrer um longo caminho com manuais? Com o Use a Cabeça! Python, você entenderá rapidamente os fundamentos do Python trabalhando com estruturas de dados e funções predefinidas. Então poderá construir seu próprio aplicativo web explorando o gerenciamento do banco de dados, tratamento de exceções e administração dos dados. Se você fica intrigado com o que pode fazer com os gerenciadores de texto, decoradores, compreensões e geradores, tudo estará aqui também. Esta segunda edição é uma experiência de aprendizado completa que o ajudará a se tornar um programador Python em pouco tempo. O que é tão especial neste livro? Com base nas últimas pesquisas em Ciência Cognitiva e Teoria do Aprendizado, o livro Use a Cabeça Python usa um formato visualmente rico, para envolver sua mente, em vez da abordagem com muito texto que o deixa com sono. Por que perder tempo lutando contra novos conceitos? Esta experiência de aprendizado multissensorial é designada para o modo como seu cérebro realmente funciona. Depoimentos: “Um livro Python deve ser tão divertido quanto a linguagem. Com o Use a Cabeça Python, o mestre Paul Barry oferece um guia rápido, divertido e envolvente para a linguagem que o deixará bem preparado para escrever um código em Python real.” ― Dr. Eric Freeman, cientista de computação, professor de tecnologia, ex diretor da Disney Online \"O Use a Cabeça Python é uma ótima introdução à linguagem e ao uso do Python no mundo real… Se você estiver procurando uma ótima introdução ao Python, este será o lugar para iniciar.” ― David Griffiths, autor e instrutor de Ágil", "Price": "R$ 113,60", "Editor": "Alta Books", "Edicao": "2ª edição (13 agosto 2018)", "Language": "Português", "Pages": "616 páginas"},
{"Title": " Data science para negócios: O que você precisa saber sobre mineração de dados e pensamento analítico de dados ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Foster Provost", "Description": "Este guia amplo, profundo, porém não muito técnico, apresenta a você os princípios fundamentais do Data Science e orienta-o através do “pensamento analítico” necessário para extrair conhecimento útil e valor de negócios a partir dos dados que você obtém. Ao aprender os princípios do Data Science, você compreenderá as diversas técnicas de mineração de dados usadas hoje. Mais importante ainda, esses princípios sustentam os processos e as estratégias necessárias para resolver problemas de negócios por meio das técnicas de mineração de dados.ELOGIOS SOBRE O LIVRO:“Este livro vai além da análise de dados para principiantes. É o guia essencial para aqueles (ou todos?) cujas empresas são construídas sobre a onipresença das oportunidades de dados e a nova ordem de tomada de decisão baseada em dados.”― Tom Phillips, CEO Dstillery; ex-diretor do Google Search e Analytics“Os dados são o alicerce das novas ondas de crescimento de produtividade, inovação e visão mais rica do cliente. Apenas recentemente visto como uma fonte de vantagem competitiva, lidar bem com os dados está rapidamente se tornando um requisito mínimo para entrar no jogo. A profunda experiência aplicada dos autores faz com que esta seja uma leitura obrigatória ― uma janela para a estratégia de seu concorrente.”― Alan Murray, Empreendedor serial; Parceiro Coriolis Ventures", "Price": "R$ 75,40", "Editor": "Alta Books", "Edicao": "1ª edição (22 março 2016)", "Language": "Português", "Pages": "404 páginas"},
{"Title": " Object-Oriented Python: Master Oop by Building Games and GUIs ", "Rating": "4,9 de 5 estrelas", "Availability": "O envio pode levar até 3 semanas.", "Author": "Irv Kalb", "Description": "Power up your Python with object-oriented programming and learn how to write powerful, efficient, and re-usable code.", "Price": "R$ 204,01", "Editor": "No Starch Press (25 janeiro 2022)", "Edicao": "None", "Language": "Inglês", "Pages": "416 páginas"},
{"Title": " Aprenda Django 3 com Exemplos: Crie Aplicações web Profissionais em Python, Começando do Zero ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Antonio Melé", "Description": "Estou estudando muito sobre Django, já estudei vários tutoriais, comprei cursos da Udemy (grande perda de tempo), adquiri outros livros sobre Python e Django, mas este é algo muito acima da média. Quanto mais eu estudo, mais procuro na Web e mais vou entendendo sobre o framework, mais eu vejo o quanto este livro é útil e abrangente.", "Price": "R$ 119,05", "Editor": "Novatec Editora", "Edicao": "1ª edição (10 agosto 2020)", "Language": "Português", "Pages": "544 páginas"},
{"Title": " Estatística prática para cientistas de dados: 50 conceitos essenciais ", "Rating": "4,6 de 5 estrelas", "Availability": "Estimativa de envio de 1 a 2 meses.", "Author": "Peter Bruce", "Description": "Tradução horrorosa, com diversos erros que você pode acabar se confundindo. Nas imagens uma comparação com a versão em inglês onde traduziram erroneamente 'roughly' como 'dificilmente', invertendo completamente a lógica do gráfico.", "Price": "R$ 93,00", "Editor": "Alta Books", "Edicao": "1ª edição (1 julho 2019)", "Language": "Português", "Pages": "392 páginas"},
{"Title": " Python e Django: desenvolvimento web moderno e ágil ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Francisco Marcelo de Barros Maciel", "Description": "Python é uma das linguagens de programação mais versáteis do mercado. Devido à sua larga utilização em áreas tão distintas como automação de tarefas repetitivas e aprendizado de máquina, aliada a uma sintaxe simples e, ao mesmo tempo, poderosa, tem sido adotada nos mais diversos setores, tanto para ensinar programação a iniciantes, quanto para tarefas avançadas como treinar um sistema de reconhecimento de imagens.O framework Django, por sua vez, é uma ferramenta madura, que simplifica grandemente a tarefa de desenvolver aplicações para a web, sem a necessidade de um container pesado para rodar o código, mas, com a possibilidade de integrar rapidamente seu código a qualquer servidor compatível para distribuir as aplicações sem complexidades adicionais. Não à toa, Django é conhecido como o “framework para perfeccionistas com prazos a cumprir”.Neste livro, você aprenderá a linguagem Python desde os conceitos básicos, mesmo que nunca tenha programado antes, ao mesmo tempo em que será apresentado aos tópicos mais avançados dessa fantástica linguagem de programação. Em seguida, seguirá uma abordagem “mão na massa” para aprender como criar uma aplicação com o Django framework, partindo do zero.Finalmente, criará um projeto simplificado de loja virtual desde a análise e projeto até a implementação para solidificar seus conhecimentos.Tudo isso com exemplos práticos e exercícios propostos e resolvidos.Desenvolver aplicações para a web com prazo e custo aceitáveis sempre foi uma tarefa desafiadora.Várias ferramentas e técnicas estão disponíveis para tentar minimizar o esforço envolvido.Dentre essas, a linguagem Python e o framework Django têm forte destaque pela simplicidade e poder que oferecem aos desenvolvedores.Nesta obra, você aprenderá a linguagem Python por meio de exemplos práticos, mesmo que nunca tenha programado antes, e poderá construir versáteis aplicações para a internet com o Django, o “framework para perfeccionistas com prazos a cumprir”.Para ajudar a fixar os conceitos, na última parte do livro, será criado um projeto simplificado de loja virtual, desde a concepção, para solidificar seus conhecimentos.Tudo isso com uma abordagem “hands-on”: exemplos práticos e exercícios propostos e resolvidos.Como brinde, todo o código fonte e respostas possíveis para os exercícios estão disponíveis para downloadna página web da editora.", "Price": "R$ 91,96", "Editor": "Alta Books", "Edicao": "1ª edição (17 agosto 2020)", "Language": "Português", "Pages": "448 páginas"},
{"Title": " Entendendo Algoritmos: Um Guia Ilustrado Para Programadores e Outros Curiosos ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Aditya Bhargava", "Description": "Na página 189 faz referencia a 3 objetos com medidas em KG.", "Price": "R$ 49,68", "Editor": "Novatec Editora", "Edicao": "1ª edição (24 abril 2017)", "Language": "Português", "Pages": "264 páginas"},
{"Title": " Hands-On Machine Learning with Scikit-Learn, Keras, and Tensorflow: Concepts, Tools, and Techniques to Build Intelligent Systems ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Aurélien Géron", "Description": "Já havia lido a primeira edição do material e fiquei bastante satisfeito com as modificações do segundo. O livro é impresso em cores e apresenta detalhes da implementação de várias técnicas e algoritmos de Machine Learning. Definitivamente é uma boa escolha para quem quer se aventurar na parte prática e sair da teoria. Os pacotes e a liguagem que são utilizados (Python, Scikit-Learn, Keras e TensorFlow) são bem adequados.", "Price": "R$ 268,70", "Editor": "O'Reilly Media", "Edicao": "2nd ed. edição (22 outubro 2019)", "Language": "Inglês", "Pages": "856 páginas"},
{"Title": " Programação Orientada à Objetos em Python: Do Básico ao Avançado ", "Rating": "Previous page", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Aprenda Programação Orientada à Objetos em Python de forma prática e descomplicada.", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "219 páginas"},
{"Title": " COLETÂNEA PYTHON NA PRÁTICA: 2 livros, 290+ páginas, 175+ exercícios ", "Rating": "4,0 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "COLETÂNEA PYTHON NA PRÁTICA", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "339 páginas"},
{"Title": " Introdução à computação e programação usando Python ", "Rating": "4,8 de 5 estrelas", "Availability": "Estimativa de envio de 2 a 3 dias.", "Author": "John V. Guttag", "Description": "Com este livro, você aprenderá a arte de resolver problemas computacionais utilizando a linguagem Python e várias de suas bibliotecas, mesmo se tiver pouca ou nenhuma experiência anterior em programação. Você dominará poderosas técnicas computacionais, incluindo ferramentas para modelar e interpretar dados. Este livro se baseia naquele que se tornou o curso mais popular oferecido através do OpenCourseWare do MIT e foi desenvolvido para ser utilizado não apenas em salas de aula convencionais, mas também em um Curso Online Aberto e Massivo (ou MOOC) oferecido na plataforma edX.org, uma colaboração pioneira entre o MIT e Harvard. A linguagem Python e os conceitos básicos de programação são apresentados no contexto de seu uso em técnicas como a enumeração exaustiva, o método da bissecção e algoritmos eficientes de aproximação. O livro não exige conhecimentos de matemática além da álgebra de nível médio, mas assume que os leitores não se sintam intimidados por conceitos matemáticos. Embora trate de temas tradicionais como a complexidade computacional e algoritmos simples, o livro se centra em uma ampla gama de temas que não são encontrados na maioria dos textos introdutórios, incluindo a visualização de informações, simulações para modelar a aleatoriedade, técnicas computacionais para compreender dados e técnicas estatísticas, além de dois temas relacionados, mas relativamente avançados: problemas de otimização e programação dinâmica. Introdução à Computação e Programação Usando Python pode servir como um trampolim para cursos mais avançados de ciência da computação ou como formação básica na resolução de problemas computacionais para os alunos de outras disciplinas.", "Price": "R$ 49,23", "Editor": "Infopress", "Edicao": "1ª edição (1 janeiro 2016)", "Language": "Português", "Pages": "360 páginas"},
{"Title": " Python Para Todos: Explorando Dados com Python 3 ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Yuri Loia de Medeiros", "Description": "Python para Todos foi feito com o objetivo de introduzir estudantes a programação e a o desenvolvimento de software através das lentes da exploração de dados. Você pode imaginar a linguagem Python como sua ferramenta para resolver problema de dados que são Python é fácil de usar e uma linguagem de programação fácil de aprender que está disponível gratuitamente nos computadores Macintosh, Windows, ou Linux. Logo, assim que você aprende Python você pode usá-la para o resto da sua carreira sem necessitar comprar nenhum software.Existem cópias eletrônicas gratuitas e disponíveis em vários formatos, além do material de suporte para o livro no site www.py4e.com. O material do curso está disponível sobmmons a Lincesa Creative Commons, logo você poderá adaptá-lo para usar no seu próprio curso de Python.Esse livro tem como objetivo ensinar pessoas a programar mesmo que elas nãotenha nenhuma experiência anterior. Esse livro pode ser utilizado para ensinarprogramação a qualquer pessoa.", "Price": "R$ 71,37", "Editor": "Independently Published (24 abril 2020)", "Edicao": "None", "Language": "Português", "Pages": "262 páginas"},
{"Title": " Jornada Python: uma Jornada Imersiva na Aplicabilidade de uma das Mais Poderosas Linguagens de Programação do Mundo (Volume 1) ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Tatiana Escovedo", "Description": "Livro mostra uma visão geral de muitos assuntos importantes e para mim foi muito bom. Com isso consegui entender e adquirir conhecimentos muito úteis para buscar aprofundamento em outras bibliográficas.", "Price": "R$ 53,51", "Editor": "Brasport", "Edicao": "1ª edição (10 março 2022)", "Language": "Português", "Pages": "552 páginas"},
{"Title": " Fundamentos de Python para Ciência de Dados ", "Rating": "Previous page", "Availability": "Este produto ainda não foi lançado.", "Author": "Kennedy R. Behrman", "Description": null, "Price": "R$ 99,00", "Editor": "Bookman", "Edicao": "1ª edição (10 novembro 2022)", "Language": "Português", "Pages": "256 páginas"},
{"Title": " Python na Prática Vol. 2: Aprenda Python Através de Exercícios Comentados ", "Rating": "5,0 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Aprenda Python do básico ao avançado através de exercícios comentados.", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "138 páginas"},
{"Title": " Architecture Patterns with Python: Enabling Test-Driven Development, Domain-Driven Design, and Event-Driven Microservices ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Harry J.W. Percival", "Description": "Recomendo esse livro fortemente para todos que buscam exemplos práticos de uma aplicação real em Python: mostra vários padrões e soluções arquiteturais para aplicações Web, os autores vão mostrando desde demain modelling até técnicas de microservices, sempre construindo o mesmo aplicativo, mostrando as soluções mais básicas, problemas que vão encontrando e como vão resolvendo. O livro é bem \"down to earth\" e nao tem medo de usar bibliotecas externas e que todos usam, entao os exemplos usam Flask, Redis, SQLAlchemy, pytest, etc. E os caras são bem honestos, final de cada capitúlo tem os prós e contras das técnicas que eles apresentaram, pra deixar claro que não existe silver-bullet ou uma solução que serve pra todos.", "Price": "R$ 294,89", "Editor": "O'Reilly Media", "Edicao": "Illustrated edição (31 março 2020)", "Language": "Inglês", "Pages": "304 páginas"},
{"Title": " Python na Prática: Aprenda Python Através de Exercícios Comentados ", "Rating": "4,7 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Aprenda Python do básico ao avançado através de exercícios comentados. Todos os exercícios propostos revisam a teoria necessária para a resolução dos mesmos, assim como cada exercício possui as devidas explicações para cada linha de código.", "Price": null, "Editor": "Uniorg (28 janeiro 2021)", "Edicao": "None", "Language": "Português", "Pages": "206 páginas"},
{"Title": " Python para Data Science para leigos ", "Rating": "4,8 de 5 estrelas", "Availability": "None", "Author": "Luca Massaron", "Description": "Você tem curiosidade sobre data science, mas se sente um pouco intimidado?Não tenha medo!Este livro mostra como usar o Python para fazer várias coisas legais com data science. Você verá como instalar o conjunto de ferramentas Anaconda para que seja fácil trabalhar com o Python. Descobrirá o Google Colab, que possibilita escrever código na nuvem usando seu tablet.Aprenderá a realizar vários tipos de cálculos interessantes usando a versão mais atual do Python e a usar as bibliotecas para análise de dados, diagramação e mais.Abra este livro e descubra…• Configuração do Python para data science• Como trabalhar com o Jupyter Notebook• Condicionamento e modelagem de dados• Gráficos com MatPlotLib• Modos de analisar dados• Algoritmos úteis de data science• Dez recursos essenciaisContém no livro:•Escreva código na nuvem com Google Colab™•Aprenda programação Python para análise de dados e estatística•Maneje dados e visualize informações", "Price": null, "Editor": "Alta Books", "Edicao": "2ª edição (31 agosto 2020)", "Language": "Português", "Pages": "496 páginas"},
{"Title": " Matemática com Python: um Guia Prático ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Guilherme Augusto", "Description": "Eu sou um consumidor de livros de Python, sempre que sai algum eu compro para ler e avaliar. Trabalho com a tecnologia a uns 8/9 anos já e sempre compro livros sobre para ver o que é falado. Esse livro em questão será útil para introduzir a programação com matemática com meu filho que em breve começará a estudar matemática e quero ensinar programação para ele. Para esse fim o livro faz bem seu papel.", "Price": "R$ 36,82", "Editor": "Novatec Editora", "Edicao": "1ª edição (9 outubro 2018)", "Language": "Português", "Pages": "192 páginas"},
{"Title": " Aprendendo Padrões de Projeto em Python: Tire Proveito da Eficácia dos Padrões de Projeto (design Patterns) em Python Para Resolver Problemas do Mundo Real em Arquitetura e Design de Software ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Chetan Giridhar", "Description": "O livro apresenta os principais design patterns e dá uma visão geral muito boa de cada um deles, junto com métodos simples de se entender. Porém, há MUITAS falhas de tradução e o código não segue o padrão do Python. Parece que um programador Java os escreveu. Além disso, existem códigos FALTANDO, o que pode comprometer o aprendizado dos desavisados.", "Price": "R$ 38,98", "Editor": "Novatec Editora (3 outubro 2016)", "Edicao": "None", "Language": "Português", "Pages": "168 páginas"},
{"Title": " TDD com Python: Siga o Bode dos Testes: Usando Django, Selenium e JavaScript ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Harry J.W. Percival", "Description": "O autor desenvolve um projeto do zero, passo a passo, explicando cada comando e cada linha de código, sem ser chato ou pedante. É objetivo, vai direto ao ponto, explicando os prós e contras do desenvolvimento orientado a testes.", "Price": "R$ 107,25", "Editor": "Novatec Editora", "Edicao": "1ª edição (12 dezembro 2017)", "Language": "Português", "Pages": "648 páginas"},
{"Title": " FUNDAMENTOS DE PYTHON: Estruturas de dados ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "KENNETH A. LAMBERT", "Description": "Este livro usa a linguagem de programação Python como forma de tornar o curso de ciência da computação mais gerenciável e atraente para alunos e professores. Aqui são abordados assuntos relacionados a: programação básica de Python; visão geral das coleções; pesquisa, ordenação e análise de complexidade; arrays e estruturas ligadas; interfaces, implementações e polimorfismo; herança e classes abstratas; pilhas; filas; listas; árvores; conjuntos e dicionários e grafos.", "Price": "R$ 96,42", "Editor": "Cengage Learning", "Edicao": "Tradução da 2ª edição norte-americana (26 abril 2022)", "Language": "Português", "Pages": "448 páginas"},
{"Title": " High Performance Python: Practical Performant Programming for Humans ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Ian Ozsvald", "Description": "Authors have done excellent job compiling the material, running performance tests, digging into details.", "Price": "R$ 227,00", "Editor": "O'Reilly Media", "Edicao": "2nd ed. edição (26 maio 2020)", "Language": "Inglês", "Pages": "468 páginas"},
{"Title": " Começando a programar em Python para leigos ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "John Paul Mueller", "Description": "Potente e dinâmico, o Python é uma linguagem de programação usada em várias aplicações e projetada para ter uma independência real de plataforma. Isso o torna uma ótima ferramenta para programadores.Com as instruções passo a passo deste livro, você aprenderá os conceitos básicos num piscar de olhos.Descubra como pode usar a programação literária com o Jupyter Notebook para criar um tipo de código de apresentação, anotações, equações matemáticas e gráficos.Abra este livro e descubra…• Como baixar e instalar o Python• Como usar a linha de comando• Sobre o uso do Jupyter Notebook• Como coletar tipos diferentes de dados• Interações com pacotes• Como encontrar e corrigir errosContém no livro:•Entenda como resolver problemas e corrigir erros•Aprenda a trabalhar com Anaconda® e usar as funções mágicas•Use o Python para criar e executar sua primeira aplicação", "Price": "R$ 75,95", "Editor": "Alta Books", "Edicao": "2ª edição (5 novembro 2020)", "Language": "Português", "Pages": "391 páginas"},
{"Title": " 300 Exercícios Resolvidos e Comentados em Python ", "Rating": "4,6 de 5 estrelas", "Availability": "None", "Author": "Fernando Feltrin", "Description": "Aprenda Python de forma prática e descomplicada através de 300 exercícios divididos desde o básico até o avançado em Python e suas bibliotecas Pandas e Numpy.", "Price": null, "Editor": "None", "Edicao": "None", "Language": "Português", "Pages": "589 páginas"},
{"Title": " Programação em Python 3 ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Mark Summerfield", "Description": "Python 3 é a melhor versão já lançada no que diz respeito à linguagem Python. Ela é muito mais poderosa, conveniente, consistente e expressiva do que jamais foi. Agora, no comando do programador Mark Summerfield, você poderá aprender como escrever códigos que se beneficiam totalmente das vantagens oriundas das características do Python 3 e de seus idiomas. Primeiro livro escrito a partir de uma visão totalmente baseada em Python 3, Programação em Python 3 traz o conhecimento que você precisa para escrever qualquer programa, utilizar qualquer biblioteca padrão ou de terceiros do Python e criar novos módulos de biblioteca por sua conta. Summerfield mostra todo o seu vasto conhecimento e experiência com o Python e o compartilha profundamente com o Python 3, algo que você não vai encontrar em nenhum outro lugar. Ele começa por iluminar o lindo coração do Python, os oito elementos-chave que você vai precisar para escrever programas robustos e altamente desenvolvidos. Apoiando-se em cima destes elementos condutores, ele introduz novos tópicos, desenvolvidos para fortalecer gradualmente sua especialidade (na prática), com exemplos conceituais que farão com que você participe efetivamente. A abordagem do livro inclui: desenvolvimento em Python, utilizando paradigmas de programações procedurais, orientado a objeto e funcionais, criação de pacotes e módulos personalizados, escrita e leitura de arquivos binários, de texto e XML, incluindo compressão opcional, acesso aleatório e analisadores de texto e analisadores XML, avanço gradual em tipos de dados, acumulados, estruturas de controle e funções, divisão de cargas sobre múltiplos processos e linhas de execução, programação de bancos de dados SQL e arquivos DBM chave-valor, utilização da minilinguagem de expressão regular e dos módulos do Python, construção de aplicações baseadas em programação GUI úteis e eficientes, técnicas de programação avançada, incluindo geradores, decoradores de classe e função, gerenciadores de contexto, descritores, classes-base abstratas, metaclasses e muito mais, programação em Python 3 prestará tanto a função de um tutorial quanto a de uma referência de linguagem, e é acompanhado por uma extensa gama de códigos, passíveis de serem baixados, todos eles foram testados com a versão final do Python 3 no Windows, Linux e Mac OS X.", "Price": "R$ 111,22", "Editor": "Alta Books", "Edicao": "1ª edição (23 novembro 2009)", "Language": "Português", "Pages": "520 páginas"},
{"Title": " Python Crash Course, 3rd Edition ", "Rating": "Previous page", "Availability": "Este produto ainda não foi lançado.", "Author": "Eric Matthes", "Description": "Python Crash Course", "Price": "R$ 248,52", "Editor": "No Starch Press", "Edicao": "3ª edição (10 janeiro 2023)", "Language": "Inglês", "Pages": "552 páginas"},
{"Title": " Problemas Clássicos de Ciência da Computação com Python ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "David Kopec", "Description": "Fui até a metade do 1º capítulo. Gostei. Mas antes de prosseguir preferi ler antes um livro mais básico para ganhar musculatura. Depois retomarei. Conheço uma miserinha de Python. Isso tem ajudado.", "Price": "R$ 50,99", "Editor": "Novatec Editora", "Edicao": "1ª edição (2 outubro 2019)", "Language": "Português", "Pages": "272 páginas"},
{"Title": " Python para análise de dados: Tratamento de dados com Pandas, NumPy e IPython ", "Rating": "4,8 de 5 estrelas", "Availability": "None", "Author": "Wes McKinney", "Description": "Obtenha instruções completas para manipular, processar, limpar e extrair informações de conjuntos de dados em Python. Atualizada para Python 3.6, este guia prático está repleto de casos de estudo práticos que mostram como resolver um amplo conjunto de problemas de análise de dados de forma eficiente. Você conhecerá as versões mais recentes do pandas, da NumPy, do IPython e do Jupyter no processo.", "Price": null, "Editor": "Novatec Editora", "Edicao": "1ª edição (10 maio 2019)", "Language": "Português", "Pages": "668 páginas"},
{"Title": " Mãos à obra: aprendizado de máquina com Scikit-Learn & TensorFlow ", "Rating": "4,7 de 5 estrelas", "Availability": "Em estoque.", "Author": "Aurélien Géron", "Description": "CONCEITOS, FERRAMENTAS E TÉCNICAS PARA A CONSTRUÇÃO DE SISTEMAS INTELIGENTES. Com uma série de recentes avanços, o aprendizado profundo impulsionou todo o campo do aprendizado de máquina. Agora, mesmo os programadores que pouco sabem sobre esta tecnologia podem utilizar ferramentas simples e eficientes para implementar programas capazes de aprender com dados. Este livro prático mostra como fazê-lo.Utilizando exemplos concretos, uma teoria mínima e duas estruturas Python prontas para produção - Scikit-Learn e TensorFlow - o autor Aurélien Géron ajuda você a adquirir uma compreensão intuitiva dos conceitos e ferramentas para a construção de sistemas inteligentes. Você aprenderá uma variedade de técnicas, começando com uma regressão linear simples e progredindo para redes neurais profundas. Com exercícios em cada capítulo para ajudá-lo a aplicar o que aprendeu, você só precisa ter experiência em programação para começar. - Explore o cenário do aprendizado de máquina, especialmente as redes neurais- Utilize o Scikit-Learn para acompanhar um exemplo de projeto de aprendizado de máquina de ponta a ponta- Examine vários modelos de treinamento, incluindo máquinas de vetor de suporte, árvores de decisão, florestas aleatórias emétodos de ensemble- Use a biblioteca TensorFlow para construir e treinar redes neurais- Mergulhe em arquiteturas de rede neural, incluindo redes convolutivas, redes recorrentes e aprendizado por reforço profundo- Aprenda técnicas para treinamento e dimensionamento de redes neurais profundas- Aplique exemplos práticos de código sem recorrer a teorias excessivas ou detalhes de algoritmo do aprendizado de máquinas", "Price": "R$ 69,30", "Editor": "Alta Books", "Edicao": "1ª edição (28 junho 2019)", "Language": "Português", "Pages": "576 páginas"},
{"Title": " Use a cabeça!: Java ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Bert Bates", "Description": "Use a Cabeça! Java é uma experiência completa de aprendizado em programação orientada a objetos (OO) e Java. Projetado de acordo com princípios de aprendizado simples, este livro mostrará de aspectos básicos da linguagem a tópicos avançados que incluem segmentos, soquetes de rede e programação distribuída.O mais importante é que você aprenderá a pensar como um desenvolvedor orientado a objetos. E não irá apenas ler: você vai participar de jogos, resolver quebra-cabeças, refletir sobre mistérios e interagir com Java de formas nunca imaginadas. No decorrer da leitura, você escreverá muitos códigos Java reais.A abordagem de aprendizado da série Use a Cabeça! o ajudará a memorizar rapidamente o conhecimento de maneira permanente. Prepare-se para abrir sua mente enquanto aprende (e compreende) tópicos-chave, entre eles:•A linguagem Java.•O desenvolvimento orientado a objetos.•A criação, o teste e a implantação de aplicativos.•O uso da biblioteca do API Java.•A manipulação de exceções.•O uso de vários segmentos.•A programação de GUI com o Swing.•A rede com RMI e soquetes.•Os conjuntos e tipos genéricos.", "Price": "R$ 161,99", "Editor": "Alta Books", "Edicao": "2ª edição (16 novembro 2007)", "Language": "Português", "Pages": "496 páginas"},
{"Title": " Introdução à Programação com Python: Algoritmos e Lógica de Programação Para Iniciantes ", "Rating": "4,8 de 5 estrelas", "Availability": "Em estoque.", "Author": "Nilo Ney Coutinho Menezes", "Description": "Com esse livro tive o meu absoluto primeiro contato com a programação e posso dizer que ele é ótimo para iniciantes. Com uma boa progressão de assuntos, aos poucos você vai percebendo sua capacidade de programar evoluindo. Minha única crítica vai para a ausência da resolução dos exercícios propostos, já que alguns são um pouco mais difíceis e, para mim, levaram dias para serem resolvidos. Por outro lado isso pode até ser positivo, pois a sensação de conseguir resolvê-los totalmente por conta utilizando os aprendizados do livro é muito recompensadora.", "Price": "R$ 49,68", "Editor": "Novatec Editora", "Edicao": "3ª edição (8 janeiro 2019)", "Language": "Português", "Pages": "328 páginas"},
{"Title": " Começando a programar em Python para leigos ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "John Paul Mueller", "Description": "Potente e dinâmico, o Python é uma linguagem de programação usada em várias aplicações e projetada para ter uma independência real de plataforma. Isso o torna uma ótima ferramenta para programadores.Com as instruções passo a passo deste livro, você aprenderá os conceitos básicos num piscar de olhos.Descubra como pode usar a programação literária com o Jupyter Notebook para criar um tipo de código de apresentação, anotações, equações matemáticas e gráficos.Abra este livro e descubra…• Como baixar e instalar o Python• Como usar a linha de comando• Sobre o uso do Jupyter Notebook• Como coletar tipos diferentes de dados• Interações com pacotes• Como encontrar e corrigir errosContém no livro:•Entenda como resolver problemas e corrigir erros•Aprenda a trabalhar com Anaconda® e usar as funções mágicas•Use o Python para criar e executar sua primeira aplicação", "Price": "R$ 75,95", "Editor": "Alta Books", "Edicao": "2ª edição (5 novembro 2020)", "Language": "Português", "Pages": "391 páginas"},
{"Title": " Aprendizado de máquina para leigos ", "Rating": "4,6 de 5 estrelas", "Availability": "Em estoque.", "Author": "Luca Massaron", "Description": "Parece um pouco assustador, mas o aprendizado de máquina é uma maneira nova e empolgante de ensinar seu computador a executar todos os tipos de tarefas úteis e importantes. Este livro é a maneira fácil de saber tudo a respeito. Ele explica como começar, contém discussões detalhadas sobre o funcionamento dos algoritmos básicos, utiliza linguagens como Python e R para tornar o aprendizado de máquina possível, especifica como fazer coisas práticas usando algoritmos comuns e muito mais!Abra este livro e descubra…• A história real da IA• Codificação com R e Python• O papel da estatística• Como gerir big data• Matemática desmistificada• Uso de modelos lineares• O que redes neurais fazem• Uso de imagens", "Price": "R$ 64,64", "Editor": "Alta Books", "Edicao": "1ª edição (8 outubro 2019)", "Language": "Português", "Pages": "432 páginas"},
{"Title": " Python e Django: desenvolvimento web moderno e ágil ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Francisco Marcelo de Barros Maciel", "Description": "Python é uma das linguagens de programação mais versáteis do mercado. Devido à sua larga utilização em áreas tão distintas como automação de tarefas repetitivas e aprendizado de máquina, aliada a uma sintaxe simples e, ao mesmo tempo, poderosa, tem sido adotada nos mais diversos setores, tanto para ensinar programação a iniciantes, quanto para tarefas avançadas como treinar um sistema de reconhecimento de imagens.O framework Django, por sua vez, é uma ferramenta madura, que simplifica grandemente a tarefa de desenvolver aplicações para a web, sem a necessidade de um container pesado para rodar o código, mas, com a possibilidade de integrar rapidamente seu código a qualquer servidor compatível para distribuir as aplicações sem complexidades adicionais. Não à toa, Django é conhecido como o “framework para perfeccionistas com prazos a cumprir”.Neste livro, você aprenderá a linguagem Python desde os conceitos básicos, mesmo que nunca tenha programado antes, ao mesmo tempo em que será apresentado aos tópicos mais avançados dessa fantástica linguagem de programação. Em seguida, seguirá uma abordagem “mão na massa” para aprender como criar uma aplicação com o Django framework, partindo do zero.Finalmente, criará um projeto simplificado de loja virtual desde a análise e projeto até a implementação para solidificar seus conhecimentos.Tudo isso com exemplos práticos e exercícios propostos e resolvidos.Desenvolver aplicações para a web com prazo e custo aceitáveis sempre foi uma tarefa desafiadora.Várias ferramentas e técnicas estão disponíveis para tentar minimizar o esforço envolvido.Dentre essas, a linguagem Python e o framework Django têm forte destaque pela simplicidade e poder que oferecem aos desenvolvedores.Nesta obra, você aprenderá a linguagem Python por meio de exemplos práticos, mesmo que nunca tenha programado antes, e poderá construir versáteis aplicações para a internet com o Django, o “framework para perfeccionistas com prazos a cumprir”.Para ajudar a fixar os conceitos, na última parte do livro, será criado um projeto simplificado de loja virtual, desde a concepção, para solidificar seus conhecimentos.Tudo isso com uma abordagem “hands-on”: exemplos práticos e exercícios propostos e resolvidos.Como brinde, todo o código fonte e respostas possíveis para os exercícios estão disponíveis para downloadna página web da editora.", "Price": "R$ 91,96", "Editor": "Alta Books", "Edicao": "1ª edição (17 agosto 2020)", "Language": "Português", "Pages": "448 páginas"},
{"Title": " Python Para Data Science: E Machine Learning Descomplicado ", "Rating": "4,5 de 5 estrelas", "Availability": "Em estoque.", "Author": "Amílcar Netto", "Description": "A era da informação trouxe consigo uma avalanche nunca vista na criação de entendimento digital. O acesso e a interpretação desses dados tornaram-se um diferencial estratégico para empresas e também para governos, e podem dar suporte a estudos em várias áreas, como Economia e Política, passando pelas Ciências Sociais. É nesse contexto que as ferramentas necessárias para o tratamento desses dados foram desenvolvidas, de forma a retornar conhecimento relevante a partir desse volume imenso de informações. Nesta obra, você terá contato com os primeiros conceitos de Ciência de Dados (Data Science). Para auxiliar o aprendizado, são desenvolvidos projetos práticos com ferramentas consideradas estado da arte na criação de aplicações de aprendizado de máquina, e, como brinde, todo o código desenvolvido está disponível para download gratuitamente no site da editora. “No mercado moderno, altamente competitivo, o conhecimento de Ciência de Dados e técnicas para sua aplicação prática é mais que um requisito: tornou-se um diferencial para qualquer profissional ou empresa.” O leitor terá uma introdução rápida à linguagem Python (para aqueles que não a conhecem) e às bibliotecas usadas em Análise de Dados. Serão desenvolvidos projetos práticos, “do zero”, para familiarizá-lo com as tecnologias envolvidas. Ao final do livro, você conhecerá uma ferramenta que permite desenvolver tais estudos mesmo sem saber programar. Esta obra aborda as principais ferramentas usadas por profissionais dessa área, tão fascinante, de modo didático e com ênfase na aplicação imediata dos conceitos apresentados.", "Price": "R$ 78,12", "Editor": "Alta Books", "Edicao": "1ª edição (8 julho 2021)", "Language": "Português", "Pages": "384 páginas"}
]